## Plan Result (sbox_mgmt)




<pre><code>Plan: 25 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.data_mgmt_zone.azurerm_key_vault_access_policy.purview
  * module.data_mgmt_zone.azurerm_network_security_group.this
  * module.data_mgmt_zone.azurerm_private_endpoint.kv_endpoint
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;account&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;blob&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;namespace&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;portal&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint[&#34;queue&#34;]
  * module.data_mgmt_zone.azurerm_private_endpoint.synapse_private_link_hub_endpoint
  * module.data_mgmt_zone.azurerm_purview_account.this[0]
  * module.data_mgmt_zone.azurerm_resource_group.new[0]
  * module.data_mgmt_zone.azurerm_role_assignment.name[0]
  * module.data_mgmt_zone.azurerm_route.default
  * module.data_mgmt_zone.azurerm_route_table.this
  * module.data_mgmt_zone.azurerm_subnet.this[&#34;services&#34;]
  * module.data_mgmt_zone.azurerm_synapse_private_link_hub.this
  * module.data_mgmt_zone.azurerm_user_assigned_identity.this
  * module.data_mgmt_zone.azurerm_virtual_network.this
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault.kv
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.data_mgmt_zone.module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_mgmt_zone.azurerm_key_vault_access_policy.purview will be created
  + resource "azurerm_key_vault_access_policy" "purview" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_network_security_group.this will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "data-mgmt-nsg-sbox"
      + resource_group_name = "data-mgmt-rg-sbox"
      + security_rule       = (known after apply)
      + tags                = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.kv_endpoint will be created
  + resource "azurerm_private_endpoint" "kv_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "data-mgmt-kv-endpoint-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "data-mgmt-rg-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "data-mgmt-kv-endpoint-connection-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["account"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "data-mgmt-purview-endpoint-account-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "data-mgmt-rg-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "data-mgmt-purview-endpoint-account-connection-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["blob"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "data-mgmt-purview-endpoint-blob-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "data-mgmt-rg-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "data-mgmt-purview-endpoint-blob-connection-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["namespace"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "data-mgmt-purview-endpoint-namespace-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "data-mgmt-rg-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "data-mgmt-purview-endpoint-namespace-connection-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "namespace",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["portal"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "data-mgmt-purview-endpoint-portal-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "data-mgmt-rg-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "data-mgmt-purview-endpoint-portal-connection-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "portal",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.purview_endpoint["queue"] will be created
  + resource "azurerm_private_endpoint" "purview_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "data-mgmt-purview-endpoint-queue-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "data-mgmt-rg-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "data-mgmt-purview-endpoint-queue-connection-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_private_endpoint.synapse_private_link_hub_endpoint will be created
  + resource "azurerm_private_endpoint" "synapse_private_link_hub_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "data-mgmt-synapse-endpoint-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "data-mgmt-rg-sbox"
      + subnet_id                = (known after apply)
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "data-mgmt-synapse-endpoint-connection-sbox"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "web",
            ]
        }
    }

  # module.data_mgmt_zone.azurerm_purview_account.this[0] will be created
  + resource "azurerm_purview_account" "this" {
      + atlas_kafka_endpoint_primary_connection_string   = (sensitive value)
      + atlas_kafka_endpoint_secondary_connection_string = (sensitive value)
      + catalog_endpoint                                 = (known after apply)
      + guardian_endpoint                                = (known after apply)
      + id                                               = (known after apply)
      + location                                         = "uksouth"
      + managed_resource_group_name                      = "data-mgmt-purview-sbox"
      + managed_resources                                = (known after apply)
      + name                                             = "data-mgmt-purview-sbox"
      + public_network_enabled                           = false
      + resource_group_name                              = "data-mgmt-rg-sbox"
      + scan_endpoint                                    = (known after apply)
      + tags                                             = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.data_mgmt_zone.azurerm_resource_group.new[0] will be created
  + resource "azurerm_resource_group" "new" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "data-mgmt-rg-sbox"
      + tags     = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_role_assignment.name[0] will be created
  + resource "azurerm_role_assignment" "name" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_route.default will be created
  + resource "azurerm_route" "default" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "default"
      + next_hop_in_ip_address = "10.10.200.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "data-mgmt-rg-sbox"
      + route_table_name       = "data-mgmt-routetable-sbox"
    }

  # module.data_mgmt_zone.azurerm_route_table.this will be created
  + resource "azurerm_route_table" "this" {
      + disable_bgp_route_propagation = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "data-mgmt-routetable-sbox"
      + resource_group_name           = "data-mgmt-rg-sbox"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_subnet.this["services"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.10.240.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "services"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "data-mgmt-rg-sbox"
      + virtual_network_name                           = "data-mgmt-vnet-sbox"
    }

  # module.data_mgmt_zone.azurerm_synapse_private_link_hub.this will be created
  + resource "azurerm_synapse_private_link_hub" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "datamgmtsynapsehubsbox"
      + resource_group_name = "data-mgmt-rg-sbox"
      + tags                = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_user_assigned_identity.this will be created
  + resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "data-mgmt-identity-sbox"
      + principal_id        = (known after apply)
      + resource_group_name = "data-mgmt-rg-sbox"
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.data_mgmt_zone.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.10.240.0/24",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "data-mgmt-vnet-sbox"
      + resource_group_name = "data-mgmt-rg-sbox"
      + subnet              = (known after apply)
      + tags                = (known after apply)
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "data-mgmt-kv-sbox"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "data-mgmt-rg-sbox"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = (known after apply)
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "8e437d06-affa-4dca-a41a-1498238cb3b9"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "4d0554dd-fe60-424a-be9c-36636826d927"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.data_mgmt_zone.module.key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox"
      + name                           = "data-mgmt-kv-sbox"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
    }

  # module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "data-mgmt-vnet-sbox-to-hub"
      + remote_virtual_network_id    = "/subscriptions/ea3a8c1e-af9d-4108-bc86-a7e2d267f49c/resourceGroups/hmcts-hub-sbox-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-sbox-int"
      + resource_group_name          = "data-mgmt-rg-sbox"
      + use_remote_gateways          = false
      + virtual_network_name         = "data-mgmt-vnet-sbox"
    }

  # module.data_mgmt_zone.module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub-to-data-mgmt-vnet-sbox"
      + remote_virtual_network_id    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/data-mgmt-rg-sbox/providers/Microsoft.Network/virtualNetworks/data-mgmt-vnet-sbox"
      + resource_group_name          = "hmcts-hub-sbox-int"
      + use_remote_gateways          = false
      + virtual_network_name         = "hmcts-hub-sbox-int"
    }

Plan: 25 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Target":"sbox_mgmt","Vars":{}} -->